Revit 2027 API
BuiltInFailures.GroupFailures.ChildrenLostOnGroupSwap Property
 Some elements could not find new hosts after changing group type and will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ChildrenLostOnGroupSwap { get; }
Public Shared ReadOnly Property ChildrenLostOnGroupSwap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ChildrenLostOnGroupSwap {
	FailureDefinitionId^ get ();
}
static member ChildrenLostOnGroupSwap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace